DuckieOnQuacks/Self-Balancing-Cube/esp32_cube_enc/web_interface.cpp
// web_interface.cpp — phone-accessible Wi-Fi control panel for the cube.
//
// The ESP32 runs its own Wi-Fi ACCESS POINT (no router or internet needed):
// connect a phone to the "Cube-Control" network, then open the IP address
// printed on the Serial monitor (normally http://192.168.4.1).
//
// Design rules for this file:
//  * HTTP handlers must never call motor-control functions directly and
//    must never block.  They only read shared state (later phases will set
//    request flags that the main control loop acts on).
//  * The balancing loop in esp32_cube_enc.cpp stays fully independent:
//    loop() just calls handleWebInterface(), which returns immediately
//    when no client is waiting.
//
// Only built-in ESP32 Arduino libraries are used here.
#include "ESP32.h"
#include <WiFi.h>
#include <WebServer.h>
#include <EEPROM.h>

// Access-point credentials.  Change the password before real use;
// WPA2 requires it to be at least 8 characters long.
const char* WIFI_NAME = "Cube-Control";
const char* WIFI_PASSWORD = "poop1234";

// HTTP server on the standard port, so plain http://<ip> works.
WebServer webServer(80);

// --- Tunable gains -----------------------------------------------------
// One table describes every gain: where it lives, the range the web
// interface will accept, and its compiled-in default.  Everything else
// (JSON output, validation, EEPROM save/load, Restore Defaults) loops over
// this table, so adding a gain means adding one row here and nothing else.
//
// The limits are generous around the defaults - they exist to stop a typo
// (a missing decimal point, a pasted value in the wrong field) from
// reaching the controller, not to constrain honest tuning.
struct GainDef {
  const char* name;
  float* ptr;         // the live variable used by the balancing loop
  float lo, hi;       // accepted range, inclusive
  float def;          // value restored by "Restore Defaults"
};
const GainDef GAIN_DEFS[] = {
  {"K1",  &K1,  0.0, 500.0, 180.0  },  // vertex: angle
  {"K2",  &K2,  0.0, 200.0,  30.0  },  // vertex: angular rate
  {"K3",  &K3,  0.0,  50.0,   1.6  },  // vertex: translational speed
  {"K4",  &K4,  0.0,   1.0,   0.008},  // vertex: motor speed
  {"zK2", &zK2, 0.0, 200.0,   8.0  },  // Z axis: angular rate
  {"zK3", &zK3, 0.0,  50.0,   0.30 },  // Z axis: motor speed
  {"eK1", &eK1, 0.0, 500.0, 190.0  },  // edge: angle
  {"eK2", &eK2, 0.0, 200.0,  31.0  },  // edge: angular rate
  {"eK3", &eK3, 0.0,  50.0,   2.5  },  // edge: motor 3 speed
  {"eK4", &eK4, 0.0,   1.0,   0.014},  // edge: motor speed
  // Auto-trim adaptation rate.  Default 0 = off, so the controller behaves
  // exactly as before until the user opts in.  The limit is small on
  // purpose: this is meant to track slow drift, not fight the balancing.
  // Negative values are allowed so the sign can be flipped from the web
  // interface if this hardware's encoder polarity is inverted.
  {"tK",  &tK, -0.5,   0.5,   0.0  },  // balance-point auto-trim rate
};
// Keep the table and the EEPROM record in step at compile time.
static_assert(sizeof(GAIN_DEFS) / sizeof(GAIN_DEFS[0]) == NUM_GAINS,
              "GAIN_DEFS and NUM_GAINS disagree");
// Prove the gain record cannot overlap the calibration offsets at address 0,
// and that both fit inside the EEPROM allocation.  Getting this wrong would
// silently corrupt calibration, so let the compiler check it.
static_assert(sizeof(OffsetsObj) <= GAINS_EEPROM_ADDR,
              "gains would overwrite the calibration offsets");
static_assert(GAINS_EEPROM_ADDR + sizeof(GainsObj) <= EEPROM_SIZE,
              "gains do not fit within EEPROM_SIZE");

// Restore saved gains at startup.  Anything missing, corrupt, or outside
// the accepted range is ignored so the compiled-in default stays in force.
void loadGains() {
  GainsObj g;
  EEPROM.get(GAINS_EEPROM_ADDR, g);
  if (g.ID != GAINS_ID) return;          // nothing saved yet
  // Only trust as many gains as the stored record actually contained.  A
  // record written by an older build with fewer gains stays valid; the ones
  // it did not know about keep their defaults.
  int n = g.count;
  if (n < 0) n = 0;
  if (n > NUM_GAINS) n = NUM_GAINS;
  for (int i = 0; i < n; i++) {
    float v = g.v[i];
    if (isnan(v) || v < GAIN_DEFS[i].lo || v > GAIN_DEFS[i].hi) continue;
    *GAIN_DEFS[i].ptr = v;
  }
  // Restore the learned balance point, range-checked the same way.  A bad
  // value simply leaves the trim at zero, which is the old behaviour.
  if (!isnan(g.trimX) && g.trimX >= -TRIM_MAX && g.trimX <= TRIM_MAX)
    trimX = g.trimX;
  if (!isnan(g.trimY) && g.trimY >= -TRIM_MAX && g.trimY <= TRIM_MAX)
    trimY = g.trimY;
  Serial.print("Loaded saved gains from EEPROM. Trim X ");
  Serial.print(trimX, 3); Serial.print(" Y "); Serial.println(trimY, 3);
}

// Write the live gains to EEPROM.  Called only from the control loop, in
// response to an explicit Save from the dashboard - never on every edit,
// because EEPROM/NVS has a finite number of write cycles.
void saveGains() {
  GainsObj g;
  g.ID = GAINS_ID;
  g.count = NUM_GAINS;                   // so a future build knows how many
  for (int i = 0; i < NUM_GAINS; i++) g.v[i] = *GAIN_DEFS[i].ptr;
  // Store the balance point learned so far, so it is in force at next boot.
  g.trimX = trimX;
  g.trimY = trimY;
  EEPROM.put(GAINS_EEPROM_ADDR, g);
  EEPROM.commit();
  Serial.println("Saved tuning gains and trim to EEPROM.");
}

// The dashboard page.  Stored in flash (PROGMEM) rather than RAM, and sent
// with send_P() so it is streamed straight from flash — no RAM copy, no
// String building.  Everything is inlined because the phone is connected to
// the cube's own access point and has no internet access to fetch assets.
const char DASHBOARD_HTML[] PROGMEM = R"rawliteral(<!DOCTYPE html>
<html><head><meta charset="utf-8">
<meta name="viewport" content="width=device-width,initial-scale=1,viewport-fit=cover">
<meta name="theme-color" content="#0e1216">
<title>Cube Control</title><style>
:root{--bg:#0e1216;--pnl:#161d24;--ln:#243039;--ink:#e8eff5;--dim:#7b8b99;
--live:#ffab1f;--ok:#3ecf8e;--stop:#ff453a}
*{box-sizing:border-box;-webkit-tap-highlight-color:transparent}
body{margin:0;background:var(--bg);color:var(--ink);font:400 16px/1.45
system-ui,-apple-system,sans-serif;-webkit-text-size-adjust:100%;
padding:16px 14px calc(20px + env(safe-area-inset-bottom))}
/* placard labels: the engineering-instrument voice */
.k{font-size:10px;text-transform:uppercase;letter-spacing:.16em;color:var(--dim)}
/* header ------------------------------------------------------------ */
header{display:flex;align-items:baseline;gap:8px;margin-bottom:16px}
h1{font-size:13px;font-weight:600;letter-spacing:.14em;text-transform:uppercase;
margin:0;flex:1}
#s{font-size:11px;color:var(--dim);text-align:right}
#lamp{width:7px;height:7px;border-radius:50%;background:var(--ln);flex:none;
align-self:center}
#lamp.a{background:var(--live);animation:p 1.6s ease-in-out infinite}
@keyframes p{50%{opacity:.25}}
/* signature: attitude target with the three wheels at their real 120° */
.inst{position:relative;width:100%;max-width:330px;margin:0 auto;
aspect-ratio:1;display:grid;place-items:center}
svg{width:76%;height:76%;overflow:visible}
/* One visualizer per pose. Vertex balancing is two-axis and uses all three
   wheels, so it gets the target. Edge balancing is a ONE-axis problem -
   only tilt X and motor 3 appear in its control law - so it gets a side-on
   pendulum instead, and the readouts that do not apply are hidden. */
#evis,body.e #vvis{display:none}
body.e #evis{display:block}
body.e .w.b,body.e .w.c{display:none}
body.e .w.a{top:auto;bottom:-4px}
body.e #ayw{opacity:.28}
.cube{fill:#1b242d;stroke:var(--live);stroke-width:2;stroke-linejoin:round;
transition:stroke .2s}
.cube.q{stroke:var(--ok)}
#ebody{transition:transform .12s linear}
.gnd{stroke:#33414d;stroke-width:2}
.piv{fill:var(--live)}
.ring{fill:none;stroke:var(--ln);stroke-width:1}
.ring.o{stroke:#33414d}
.ax{stroke:var(--ln);stroke-width:1;stroke-dasharray:2 5}
#dot{fill:var(--live);transition:cx .12s linear,cy .12s linear,fill .2s}
#dot.q{fill:var(--ok)}
.tick{font:9px ui-monospace,monospace;fill:var(--dim);letter-spacing:.05em}
/* three motor readouts, placed where the wheels actually are */
.w{position:absolute;width:74px;text-align:center}
.w.a{top:-2px;left:50%;transform:translateX(-50%)}      /* M3  top    */
.w.b{bottom:2px;left:-2px}                              /* M1  lower left  */
.w.c{bottom:2px;right:-2px}                             /* M2  lower right */
.w b{display:block;font:400 17px/1.1 ui-monospace,SFMono-Regular,Menlo,monospace;
font-variant-numeric:tabular-nums;margin-top:3px}
.bar{height:2px;background:var(--ln);margin-top:5px;border-radius:2px;
overflow:hidden}
.bar i{display:block;height:100%;width:0;background:var(--live);
transition:width .15s linear}
/* angle readouts ----------------------------------------------------- */
.ang{display:grid;grid-template-columns:1fr 1fr;gap:10px;margin:18px 0 4px}
.ang div{background:var(--pnl);border:1px solid var(--ln);border-radius:10px;
padding:10px 12px}
.ang b{display:block;font:300 30px/1.1 ui-monospace,SFMono-Regular,Menlo,monospace;
font-variant-numeric:tabular-nums;letter-spacing:-.03em;margin-top:4px}
/* status ------------------------------------------------------------- */
.st{display:flex;flex-wrap:wrap;gap:6px;margin:14px 0}
.p{font-size:11px;font-weight:600;letter-spacing:.1em;padding:5px 10px;
border-radius:6px;background:var(--pnl);border:1px solid var(--ln);
color:var(--dim)}
.p.on{color:var(--ok);border-color:#1f4d3a}
.p.live{color:var(--live);border-color:#5c4212}
.p.off{color:var(--stop);border-color:#5c231f}
/* controls ----------------------------------------------------------- */
button{font-family:inherit;border:0;border-radius:10px;color:var(--ink);
touch-action:manipulation;user-select:none}
#stop{width:100%;min-height:76px;font-size:19px;font-weight:700;
letter-spacing:.14em;color:#fff;background:var(--stop);
box-shadow:0 6px 20px -8px var(--stop)}
#stop:active{background:#c9302a;box-shadow:none}
.ab{display:grid;grid-template-columns:1fr 1fr;gap:10px;margin-top:10px}
.b{min-height:48px;padding:12px;font-size:14px;font-weight:600;
letter-spacing:.06em;background:var(--pnl);border:1px solid var(--ln)}
.b:active{background:#1f2831}
.b:active,#stop:active{transform:scale(.97)}
button:disabled{opacity:.5}
/* Result flash on the button that was pressed: green accepted, red rejected.
   Keyframed rules outrank the normal ones, so #stop's glow gives way. */
.ok{animation:fok .7s}
.er{animation:fer .7s}
@keyframes fok{0%,55%{box-shadow:inset 0 0 0 2px var(--ok)}}
@keyframes fer{0%,55%{box-shadow:inset 0 0 0 2px var(--stop)}}
.b.w1{grid-column:1/-1}
/* collapsible sections ----------------------------------------------- */
details{background:var(--pnl);border:1px solid var(--ln);border-radius:10px;
margin-top:10px}
summary{padding:14px;font-size:12px;font-weight:600;letter-spacing:.14em;
text-transform:uppercase;cursor:pointer;list-style:none;display:flex;
align-items:center;gap:8px}
summary::-webkit-details-marker{display:none}
summary:after{content:'';width:6px;height:6px;border-right:1.5px solid var(--dim);
border-bottom:1.5px solid var(--dim);transform:rotate(45deg);margin-left:auto;
transition:transform .2s}
details[open] summary:after{transform:rotate(-135deg)}
.bd{padding:0 14px 14px}
.note{font-size:12px;color:var(--dim);margin:0 0 12px}
/* gain grid ---------------------------------------------------------- */
.gl{display:grid;grid-template-columns:1fr 1fr;gap:8px}
.gr{display:flex;align-items:center;gap:7px}
.gr span{font:11px ui-monospace,monospace;color:var(--dim);width:2.6em;
letter-spacing:.04em}
.gr input{flex:1;min-width:0;background:var(--bg);color:var(--ink);
border:1px solid var(--ln);border-radius:7px;padding:9px 8px;font:14px
ui-monospace,SFMono-Regular,Menlo,monospace;font-variant-numeric:tabular-nums}
.gr input:focus{outline:2px solid var(--live);outline-offset:-1px;
border-color:transparent}
:focus-visible{outline:2px solid var(--live);outline-offset:2px}
/* yaw slider: full width, thumb sized for a fingertip */
input[type=range]{width:100%;margin:10px 0 2px;accent-color:var(--live);
height:28px}
.m{font-family:ui-monospace,SFMono-Regular,Menlo,monospace;
font-variant-numeric:tabular-nums;font-size:15px}
@media(prefers-reduced-motion:reduce){*{animation:none!important;
transition:none!important}
/* no animation, so hold the outcome as a static ring until the next press */
.ok{box-shadow:inset 0 0 0 2px var(--ok)}
.er{box-shadow:inset 0 0 0 2px var(--stop)}}
</style></head><body>

<header><span id="lamp"></span><h1>Cube</h1><div id="s">connecting</div></header>

<!-- Attitude target. The outer ring is the real +/-7 deg disengage limit from
     angle_calc(); the radial scale is sqrt so the sub-degree angles seen while
     balancing are actually visible. Motors sit at their true 120 deg spacing. -->
<div class="inst">
<svg id="vvis" viewBox="0 0 200 200" aria-hidden="true">
<circle class="ring o" cx="100" cy="100" r="70"/>
<circle class="ring" cx="100" cy="100" r="46"/>
<circle class="ring" cx="100" cy="100" r="26"/>
<line class="ax" x1="18" y1="100" x2="182" y2="100"/>
<line class="ax" x1="100" y1="18" x2="100" y2="182"/>
<circle class="ring" cx="100" cy="100" r="4"/>
<text class="tick" x="103" y="70">3°</text>
<text class="tick" x="103" y="26">7°</text>
<circle id="dot" cx="100" cy="100" r="5"/>
</svg>
<!-- Edge view: the cube seen along the edge it stands on, so its outline is
     a square balanced on one corner. It pivots about the contact point,
     which is what the eK1 term is actually regulating. Rotation uses the
     same sqrt scale as the target above, so sub-degree tilts are visible;
     the true angle is on the Tilt X readout. -->
<svg id="evis" viewBox="0 0 200 200" aria-hidden="true">
<line class="ax" x1="100" y1="14" x2="100" y2="170"/>
<g id="ebody"><polygon id="ecube" class="cube"
points="100,170 158,112 100,54 42,112"/></g>
<line class="gnd" x1="14" y1="170" x2="186" y2="170"/>
<circle class="piv" cx="100" cy="170" r="3.5"/>
<text class="tick" x="105" y="20">upright</text>
</svg>
<div class="w a"><span class="k">M3</span><b id="m3">—</b>
<div class="bar"><i id="b3"></i></div></div>
<div class="w b"><span class="k">M1</span><b id="m1">—</b>
<div class="bar"><i id="b1"></i></div></div>
<div class="w c"><span class="k">M2</span><b id="m2">—</b>
<div class="bar"><i id="b2"></i></div></div>
</div>

<div class="ang">
<div><span class="k">Tilt X</span><b id="ax">—</b></div>
<div id="ayw"><span class="k">Tilt Y</span><b id="ay">—</b></div>
</div>

<div class="st">
<span class="p" id="armed">ARMED</span>
<span class="p" id="cal">CALIBRATION</span>
<span class="p" id="mode">MODE</span>
<span class="p" id="bv">— V</span>
</div>

<button id="stop">SAFE STOP</button>
<div class="ab"><button class="b" id="arm">ARM</button>
<button class="b" id="disarm">DISARM</button></div>

<details><summary>Motion</summary><div class="bd">
<div style="display:flex;justify-content:space-between;align-items:baseline">
<span class="k">Yaw rate</span><b class="m" id="yv">0 °/s</b></div>
<input type="range" id="yaw" min="-90" max="90" step="5" value="0">
<button class="b w1" id="ystop" style="margin-top:8px">Stop spin</button>
<p class="note">Spins the cube about its vertical axis while balancing.
Returns to zero on stop, disarm or arm.</p>
<div style="display:flex;justify-content:space-between;align-items:baseline">
<span class="k">Learned trim</span><b class="m" id="tv">—</b></div>
<p class="note" id="tn">Auto-trim is off. Set the tK gain above zero to
enable it.</p>
<button class="b w1" id="treset">Reset trim</button>
<p class="note">Saved with the gains, so it applies from the next boot.
Reset it after changing the cube's hardware, then save again.</p>
</div></details>

<details><summary>Calibration</summary><div class="bd">
<p class="note" id="ch">—</p>
<p class="note" id="cr" style="color:var(--live)"></p>
<p class="note" id="raw" style="font-family:ui-monospace,monospace;font-size:11px">
raw</p>
<div class="ab" style="margin:0">
<button class="b" id="cstart">Start</button>
<button class="b" id="ccap">Capture pose</button>
<button class="b w1" id="csave">Save calibration</button></div>
</div></details>

<details><summary>Gains</summary><div class="bd">
<div id="gl" class="gl">Loading…</div>
<div class="ab">
<button class="b" id="gapply">Apply</button>
<button class="b" id="gdef">Restore defaults</button>
<button class="b w1" id="gsave">Save gains + trim</button></div>
<p class="note" id="gm" style="margin:12px 0 0">Changes take effect at once.
They are lost on restart until you save.</p>
</div></details>

