DuckieOnQuacks/Self-Balancing-Cube/esp32_cube_enc/web_interface.cpp
<script>
var $=function(i){return document.getElementById(i);};
var busy=false;                        // one request at a time: the ESP32
                                       // WebServer serves a single client,
                                       // so never let polls pile up
var mmax=40;                           // motor bar full-scale, auto-ranging
function pill(el,cls,txt){el.textContent=txt;el.className='p '+cls;}
// Degrees -> radius. sqrt so 0.5 deg is visible while 7 deg lands on the ring.
function rad(a){
 var m=Math.min(Math.abs(a)/7,1);
 return (a<0?-1:1)*Math.sqrt(m)*70;
}
// Same curve for the edge pendulum, mapped to +/-22 deg of visible rotation
// so the cube reads as tipping without leaving the frame.
function tilt(a){return rad(a)/70*22;}
function poll(){
 if(busy)return; busy=true;
 fetch('/api/state',{cache:'no-store'}).then(function(r){return r.json();})
 .then(function(d){
  $('ax').textContent=d.robot_angleX.toFixed(2)+'°';
  $('ay').textContent=d.robot_angleY.toFixed(2)+'°';
  $('dot').setAttribute('cx',100+rad(d.robot_angleX));
  $('dot').setAttribute('cy',100-rad(d.robot_angleY));
  // Green inside the vertex capture window, amber once it is drifting.
  var q=Math.abs(d.robot_angleX)<0.4&&Math.abs(d.robot_angleY)<0.4;
  $('dot').setAttribute('class',q?'q':'');  // SVG: className is read-only
  // Edge pendulum. Both visualizers are updated unconditionally - it is two
  // attribute writes - and CSS shows whichever one matches the pose.
  $('ebody').setAttribute('transform',
    'rotate('+tilt(d.robot_angleX).toFixed(2)+',100,170)');
  $('ecube').setAttribute('class',
    'cube'+(Math.abs(d.robot_angleX)<0.4?' q':''));
  // Edge mode only when the firmware is actually in it; anything else keeps
  // the general-purpose attitude target.
  document.body.classList.toggle('e',d.vertical_edge&&!d.vertical_vertex);
  var s=[d.motor1_speed,d.motor2_speed,d.motor3_speed];
  mmax=Math.max(40,Math.abs(s[0]),Math.abs(s[1]),Math.abs(s[2]));
  for(var i=0;i<3;i++){
   $('m'+(i+1)).textContent=s[i];
   $('b'+(i+1)).style.width=(Math.abs(s[i])/mmax*100)+'%';
  }
  $('bv').textContent=d.batt_voltage.toFixed(2)+' V';
  $('lamp').className=d.armed?'a':'';
  pill($('armed'),d.armed?'live':'off',d.armed?'ARMED':'DISARMED');
  pill($('cal'),d.calibrated?'on':'off',
       d.calibrating?'CALIBRATING':(d.calibrated?'CALIBRATED':'NOT CALIBRATED'));
  // Pose is detected even while disarmed, so only colour it when it can act.
  var m=d.vertical_vertex?'VERTEX':(d.vertical_edge?'EDGE':'IDLE');
  pill($('mode'),(d.vertical_vertex||d.vertical_edge)&&d.armed?'live':'',m);
  // Tell the user which calibration step comes next.  Calibration is
  // blocked while balancing, so say that instead when it applies.
  var bal=d.armed&&(d.vertical_vertex||d.vertical_edge)&&d.calibrated
          &&!d.calibrating;
  $('ch').textContent=
   bal?'Balancing. Press DISARM before calibrating.':
   (!d.calibrating?'Idle. Press Start to begin.':
   (!d.vertex_calibrated?'Step 1 — set the cube on a VERTEX, then capture.':
    'Step 2 — set the cube on an EDGE, then capture. Saves automatically.'));
  // Result of the last capture, plus the raw counts the pose test actually
  // uses. Both used to be Bluetooth-only.
  $('cr').textContent=d.cal_result||'';
  $('raw').textContent='raw  X '+d.acX+'   Y '+d.acY+'   Z '+d.acZ;
  // Learned balance-point trim. Only meaningful once tK is above zero.
  $('tv').textContent=d.trimX.toFixed(2)+'° / '+d.trimY.toFixed(2)+'°';
  var tk=G&&G.tK?G.tK.v:0;
  $('tn').textContent=tk>0
   ?'Auto-trim active (tK '+tk+'). Values settle as the cube balances.'
   :'Auto-trim is off. Set the tK gain above zero to enable it.';
  // Reflect the firmware's actual yaw command unless the user is dragging.
  if(!dragging)$('yv').textContent=d.yaw_rate.toFixed(0)+' °/s';
  // Don't erase a command result the user has not had time to read.
  if(Date.now()>msgUntil)$('s').textContent='live';
 }).catch(function(){$('s').textContent='no signal';})
 .then(function(){busy=false;});
}
setInterval(poll,300);                 // 300 ms refresh (spec: 250-500 ms)
poll();
// --- button feedback --------------------------------------------------
// A press has to be visibly acknowledged even over a slow AP link, so every
// command button greys out while its request is in flight, then flashes the
// outcome.  msgUntil holds the header text against the 300 ms poll.
var msgUntil=0;
function say(t){$('s').textContent=t;msgUntil=Date.now()+2500;}
function flash(b,ok){
 if(!b)return;
 b.disabled=false;
 b.classList.remove('ok','er');
 void b.offsetWidth;                   // reflow: restarts the animation when
 b.classList.add(ok?'ok':'er');        // the same button is pressed again
}
// Sends a command request only; the main control loop acts on it.
function send(cmd,b){
 var n=cmd.replace('_',' ');
 // SAFE STOP is never disabled - a hung request must not make it unpressable.
 // Everything else re-enables on a watchdog in case no response ever arrives.
 if(b&&b.id!='stop'){b.disabled=true;
  setTimeout(function(){b.disabled=false;},3000);}
 say(n+'…');
 fetch('/api/command',{method:'POST',
  headers:{'Content-Type':'application/x-www-form-urlencoded'},
  body:'cmd='+cmd})
 .then(function(r){return r.text().then(function(t){
   // Show the firmware's own reason ("disarm first", "stop pending") rather
   // than a bare status code - that is the part worth reading.
   var e='';try{e=JSON.parse(t).error||'';}catch(x){}
   say(r.ok?n+' sent':n+' rejected — '+(e||r.status));
   flash(b,r.ok);
  });})
 .catch(function(){say(n+' failed');flash(b,false);});
}
// One binder for every command button, with an optional confirmation.
function bind(id,cmd,ask){$(id).onclick=function(){
 if(ask&&!confirm(ask))return;
 send(cmd,this);};}
bind('stop','stop');
bind('disarm','disarm');
// Arming re-enables balancing, so require a deliberate confirmation.
bind('arm','arm','Arm the cube? Balancing will resume.');
// --- gain editing -----------------------------------------------------
// The form is built from /api/gains so the firmware's gain table stays the
// single source of truth: add a gain there and it appears here too.
var G=null;
function loadG(){
 fetch('/api/gains',{cache:'no-store'}).then(function(r){return r.json();})
 .then(function(g){
  G=g; var h='';
  for(var k in g){
   h+='<label class="gr"><span>'+k+'</span><input id="g_'+k+
      '" type="number" step="any" min="'+g[k].lo+'" max="'+g[k].hi+
      '" value="'+(+g[k].v.toFixed(4))+'"></label>';
  }
  $('gl').innerHTML=h;
 });
}
loadG();
function applyG(btn){
 if(!G)return;
 // Send every field; the firmware validates each one and rejects the whole
 // request if any is out of range.
 var b=[];
 for(var k in G){b.push(k+'='+$('g_'+k).value);}
 if(btn)btn.disabled=true;
 $('gm').textContent='Applying…';
 fetch('/api/gains',{method:'POST',
  headers:{'Content-Type':'application/x-www-form-urlencoded'},
  body:b.join('&')})
 .then(function(r){return r.json().then(function(j){
   $('gm').textContent=r.ok?'Applied. Save to keep them after a restart.'
                           :('Rejected — '+j.error);
   flash(btn,r.ok);
   if(r.ok)loadG();                    // re-read what the firmware accepted
  });})
 .catch(function(){$('gm').textContent='Apply failed.';flash(btn,false);});
}
$('gapply').onclick=function(){applyG(this);};
$('gdef').onclick=function(){
 // Restore Defaults just fills the form with the firmware's defaults and
 // applies them - still not saved until SAVE is pressed.
 if(!G||!confirm('Restore default gains?'))return;
 for(var k in G){$('g_'+k).value=+G[k].d.toFixed(4);}
 applyG(this);
};
bind('gsave','gains_save','Save gains and the learned trim to EEPROM?');
// --- yaw slider -------------------------------------------------------
// Dragging fires continuously, so the rate is sent at most every 150 ms.
// The ESP32 serves one client at a time; an unthrottled slider would queue
// requests faster than they drain and stall the telemetry poll.
var dragging=false,ySent=0,yPend=null;
function sendYaw(v){
 fetch('/api/command',{method:'POST',
  headers:{'Content-Type':'application/x-www-form-urlencoded'},
  body:'cmd=yaw&rate='+v})
 .catch(function(){$('s').textContent='yaw failed';});
}
function yawChanged(){
 var v=$('yaw').value;
 $('yv').textContent=v+' °/s';
 var now=Date.now();
 if(now-ySent>150){ySent=now;sendYaw(v);}
 else{clearTimeout(yPend);
      yPend=setTimeout(function(){ySent=Date.now();sendYaw($('yaw').value);},150);}
}
$('yaw').oninput=function(){dragging=true;yawChanged();};
$('yaw').onchange=function(){dragging=false;yawChanged();};
$('ystop').onclick=function(){$('yaw').value=0;dragging=false;yawChanged();
 flash(this,true);say('spin stopped');};
bind('treset','trim_reset');
bind('cstart','cal_start');
bind('ccap','cal_capture');
// Saving writes EEPROM, so confirm before spending a write cycle.
bind('csave','cal_save','Save calibration to EEPROM?');
</script></body></html>)rawliteral";

// GET /  — serve the dashboard straight from flash.
void handleRoot() {
  webServer.send_P(200, "text/html", DASHBOARD_HTML);
}

// GET /api/state  — read-only telemetry snapshot as JSON.
//
// This handler only READS shared state; it never commands the motors.
// No locking is needed: handleWebInterface() is called from the same loop()
// as the balancing code, so this can never interrupt a control iteration
// mid-update — the values below are always from a completed iteration.
void handleApiState() {
  // Fixed stack buffer instead of String concatenation: bounded memory and
  // no heap fragmentation on a long-running controller.
  // 640 rather than 512: the raw accelerometer values and cal_result string
  // added when Bluetooth was removed push the worst case past the old size,
  // and snprintf truncates silently - which would emit malformed JSON.
  char json[640];
  int n = snprintf(json, sizeof(json),
    "{"
      "\"robot_angleX\":%.3f,"
      "\"robot_angleY\":%.3f,"
      "\"gyroXfilt\":%.3f,"
      "\"gyroYfilt\":%.3f,"
      "\"gyroZ\":%.3f,"
      "\"motor1_speed\":%d,"
      "\"motor2_speed\":%d,"
      "\"motor3_speed\":%d,"
      "\"speed_X\":%.3f,"
      "\"speed_Y\":%.3f,"
      "\"vertical_vertex\":%s,"
      "\"vertical_edge\":%s,"
      "\"calibrated\":%s,"
      "\"calibrating\":%s,"
      "\"vertex_calibrated\":%s,"
      "\"armed\":%s,"
      "\"batt_voltage\":%.2f,"
      // Raw accelerometer counts.  During a first-time calibration the
      // corrected angles above are computed from EEPROM garbage, so these
      // are the only trustworthy numbers - and the pose accept/reject
      // thresholds are applied to exactly these values.
      "\"acX\":%d,"
      "\"acY\":%d,"
      "\"acZ\":%d,"
      // Learned balance-point offset and the active yaw command.
      "\"trimX\":%.3f,"
      "\"trimY\":%.3f,"
      "\"yaw_rate\":%.1f,"
      "\"cal_result\":\"%s\""
    "}",
    robot_angleX, robot_angleY,
    gyroXfilt, gyroYfilt, gyroZ,
    motor1_speed, motor2_speed, motor3_speed,
    speed_X, speed_Y,
    // JSON has no C-style booleans, so emit the literals true/false.
    vertical_vertex ? "true" : "false",
    vertical_edge   ? "true" : "false",
    calibrated      ? "true" : "false",
    calibrating       ? "true" : "false",
    vertex_calibrated ? "true" : "false",
    armed             ? "true" : "false",
    batt_voltage,
    AcX, AcY, AcZ, trimX, trimY, yaw_rate_cmd,
    cal_result);
  // Truncated JSON would be malformed, so refuse to send it rather than let
  // the dashboard silently fail to parse.
  if (n < 0 || n >= (int)sizeof(json)) {
    webServer.send(500, "application/json",
                   "{\"ok\":false,\"error\":\"state buffer overflow\"}");
    return;
  }
  webServer.send(200, "application/json", json);
}

