DuckieOnQuacks/Self-Balancing-Cube/esp32_cube_enc/web_interface.cpp
// GET /api/gains  — current value, accepted range, and default for each gain.
// Read-only; the dashboard uses it to build the editing form.
void handleApiGains() {
  char json[1024];
  int n = 0;
  n += snprintf(json + n, sizeof(json) - n, "{");
  for (int i = 0; i < NUM_GAINS && n < (int)sizeof(json); i++) {
    n += snprintf(json + n, sizeof(json) - n,
                  "%s\"%s\":{\"v\":%.4f,\"lo\":%.4f,\"hi\":%.4f,\"d\":%.4f}",
                  i ? "," : "", GAIN_DEFS[i].name, *GAIN_DEFS[i].ptr,
                  GAIN_DEFS[i].lo, GAIN_DEFS[i].hi, GAIN_DEFS[i].def);
  }
  n += snprintf(json + n, sizeof(json) - n, "}");
  if (n >= (int)sizeof(json)) {         // never send truncated JSON
    webServer.send(500, "application/json",
                   "{\"ok\":false,\"error\":\"gain buffer overflow\"}");
    return;
  }
  webServer.send(200, "application/json", json);
}

// POST /api/gains  — temporarily change one or more gains, e.g. "K1=185&K3=2".
//
// Changes apply in RAM only; they are lost on restart unless the user then
// presses Save.  Every supplied value is validated BEFORE any is applied, so
// a single bad field cannot leave the controller half-updated.
//
// Assigning the gains here is safe despite this being an HTTP handler:
// handleClient() is called from loop(), so this code cannot interrupt a
// control-loop iteration - it runs strictly between them.
void handleApiGainsSet() {
  float staged[NUM_GAINS];
  bool  present[NUM_GAINS] = {false};
  int   count = 0;

  // Pass 1: parse and validate everything.
  for (int i = 0; i < NUM_GAINS; i++) {
    if (!webServer.hasArg(GAIN_DEFS[i].name)) continue;
    String raw = webServer.arg(GAIN_DEFS[i].name);

    // strtod rather than toFloat(): toFloat() silently returns 0 for
    // garbage, which would quietly zero a gain instead of reporting an error.
    const char* s = raw.c_str();
    char* end;
    double v = strtod(s, &end);
    while (*end == ' ') end++;                 // tolerate trailing spaces
    bool bad = (end == s) || (*end != '\0') || isnan(v) || isinf(v);
    if (!bad && (v < GAIN_DEFS[i].lo || v > GAIN_DEFS[i].hi)) bad = true;

    if (bad) {
      char err[160];
      snprintf(err, sizeof(err),
               "{\"ok\":false,\"error\":\"%s must be a number between "
               "%.4f and %.4f\"}",
               GAIN_DEFS[i].name, GAIN_DEFS[i].lo, GAIN_DEFS[i].hi);
      webServer.send(400, "application/json", err);
      return;                                  // nothing applied
    }
    staged[i] = (float)v;
    present[i] = true;
    count++;
  }

  if (count == 0) {
    webServer.send(400, "application/json",
                   "{\"ok\":false,\"error\":\"no known gain supplied\"}");
    return;
  }

  // Pass 2: everything validated, so apply.
  for (int i = 0; i < NUM_GAINS; i++)
    if (present[i]) *GAIN_DEFS[i].ptr = staged[i];

  char json[64];
  snprintf(json, sizeof(json), "{\"ok\":true,\"applied\":%d}", count);
  webServer.send(200, "application/json", json);
}

// POST /api/command  — accepts "cmd=stop", "cmd=disarm" or "cmd=arm".
//
// SAFETY: this handler does not command the motors and does not change the
// balancing state itself.  It only records a request; the main control loop
// applies it at the start of its next cycle (within one 15 ms period).
void handleApiCommand() {
  if (!webServer.hasArg("cmd")) {
    webServer.send(400, "application/json",
                   "{\"ok\":false,\"error\":\"missing cmd\"}");
    return;
  }
  String cmd = webServer.arg("cmd");

  uint8_t req;
  // Commands that must not run while the motors are balancing: the
  // calibration steps, and anything that writes EEPROM.
  bool needs_idle = false;
  if (cmd == "stop")        req = WEB_CMD_STOP;
  else if (cmd == "disarm") req = WEB_CMD_DISARM;
  else if (cmd == "arm")    req = WEB_CMD_ARM;
  else if (cmd == "cal_start")   { req = WEB_CMD_CAL_START;   needs_idle = true; }
  else if (cmd == "cal_capture") { req = WEB_CMD_CAL_CAPTURE; needs_idle = true; }
  else if (cmd == "cal_save")    { req = WEB_CMD_CAL_SAVE;    needs_idle = true; }
  // Saving gains writes EEPROM, so it needs an idle cube for the same
  // reason the calibration commands do.
  else if (cmd == "gains_save")  { req = WEB_CMD_GAINS_SAVE;  needs_idle = true; }
  else if (cmd == "trim_reset")  req = WEB_CMD_TRIM_RESET;
  else if (cmd == "yaw") {
    // Yaw is a setpoint, not an action: record the requested rate and
    // return.  The control loop clamps and applies it on its next pass;
    // nothing here touches a motor.
    if (!webServer.hasArg("rate")) {
      webServer.send(400, "application/json",
                     "{\"ok\":false,\"error\":\"yaw needs a rate\"}");
      return;
    }
    String raw = webServer.arg("rate");
    const char* s = raw.c_str();
    char* end;
    double v = strtod(s, &end);
    while (*end == ' ') end++;
    if (end == s || *end != '\0' || isnan(v) || isinf(v)
        || v < -YAW_RATE_MAX || v > YAW_RATE_MAX) {
      char err[128];
      snprintf(err, sizeof(err),
               "{\"ok\":false,\"error\":\"rate must be a number between "
               "%.0f and %.0f deg/s\"}", -YAW_RATE_MAX, YAW_RATE_MAX);
      webServer.send(400, "application/json", err);
      return;
    }
    yaw_rate_request = (float)v;
    webServer.send(200, "application/json", "{\"ok\":true,\"cmd\":\"yaw\"}");
    return;
  }
  else {
    // Reject anything unrecognised rather than silently ignoring it.
    webServer.send(400, "application/json",
                   "{\"ok\":false,\"error\":\"unknown cmd\"}");
    return;
  }

  // Never calibrate or write EEPROM while the motors are actively balancing.
  // Rejecting here
  // gives the user immediate feedback; the control loop re-checks before
  // acting, since the cube could start balancing in between.
  if (needs_idle && balancingActive()) {
    webServer.send(409, "application/json",
                   "{\"ok\":false,\"error\":\"not while balancing"
                   " - disarm first\"}");
    return;
  }

